server/app/controllers/messages_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "messages" ("description", "conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Nice glove!"], ["conversation_id", 4], ["user_id", 4], ["created_at", "2018-03-15 17:55:17.374988"], ["updated_at", "2018-03-15 17:55:17.374988"]]
---
def create
 message = Conversation.find(params[:conversation_id]).messages.new(message_params)
 if message.save