server/app/controllers/posts_controller.rb

  def create
      post = Post.new(create_params)
      render json: post
      post.user = current_user
      if post.save
---
INSERT INTO "posts" ("description", "image_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "as nb sdb sdb dbnv "], ["image_url", "sn dn nd nfv nf vfn"], ["user_id", 1], ["created_at", "2018-03-12 20:52:54.796917"], ["updated_at", "2018-03-12 20:52:54.796917"]]

  def update
    post = current_user.posts.find(params[:id])
    if post.update(update_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["description", "Will be moving and I no longer need my lawn mower. Make me an offer! Please!"], ["updated_at", "2018-03-16 07:30:52.420280"], ["id", 3]]

  def destroy
    post = current_user.posts.find(params[:id])
    post.destroy!
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 0], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]

  def load_post
    post = current_user.posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]