server/app/controllers/users_controller.rb

  def create
    username = params[:username]
    password = params[:password]
    image_url = params[:image_url]


    new_user = User.create({
      password: password,
      username: username
    })
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    user = current_user
    if user.update(update_params)
---
UPDATE "users" SET "image_url" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["image_url", "http://www.dunamisnews.com/images/uk-anime.net/Images/cowboy-bebop-netflix-uk.jpg"], ["updated_at", "2018-03-14 06:52:51.023575"], ["id", 2]]

  def login
    username = params[:username]
    password = params[:password]

    user = User.find_from_credentials username, password
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "hellotest"], ["LIMIT", 1]]